'use client';
import { TranslationMessages } from 'ra-core';

const tamilMessages: TranslationMessages = {
    ra: {
        action: {
            add_filter: 'வடிகட்டு சேர்',
            add: 'சேர்',
            back: 'பின் செல்லுங்கள்',
            bulk_actions: '1 பொருட்டு தேர்ந்தெடுக்கப்பட்டது |||| %{smart_count} பொருட்டுகள் தேர்ந்தெடுக்கப்பட்டது',
            cancel: 'ரத்துசெய்',
            clear_array_input: 'பட்டியலை அழிக்கவும்',
            clear_input_value: 'மதிப்பை அழிக்கவும்',
            clone: 'நகல் எடு',
            confirm: 'உறுதிப்படுத்து',
            create: 'உருவாக்கு',
            create_item: 'உருவாக்கு %{item}',
            delete: 'நீக்கு',
            edit: 'திருத்து',
            export: 'ஏற்றுமதி',
            list: 'பட்டியல்',
            refresh: 'புதுப்பி',
            remove_filter: 'இந்த வடிகட்டை அகற்று',
            remove_all_filters: 'அனைத்து வடிகட்டையும் அகற்று',
            remove: 'அகற்று',
            save: 'சேமி',
            search: 'தேடு',
            select_all: 'அனைத்தையும் தேர்ந்தெடு',
            select_row: 'இந்த வரிசையைத் தேர்ந்தெடு',
            show: 'காட்டு',
            sort: 'வரிசைப்படுத்து',
            undo: 'மீட்டமை',
            unselect: 'தேர்ந்தெடுக்காதே',
            expand: 'விரிவாக்கு',
            close: 'மூடு',
            open_menu: 'மெனு திறக்கவும்',
            close_menu: 'மெனு மூடுக',
            update: 'புதுப்பி',
            move_up: 'மேலே நகர்த்து',
            move_down: 'கீழே அழுத்து',
            open: 'திற',
            toggle_theme: 'தீமை மாற்று',
            select_columns: 'பத்திகள்',
        },
        boolean: {
            true: 'ஆம்',
            false: 'இல்லை',
            null: ' ',
        },
        page: {
            create: 'உருவாக்கு %{name}',
            dashboard: 'டாஷ்போர்டு',
            edit: '%{name} %{recordRepresentation} திருத்து',
            error: 'ஏதாவது பிழை ஏற்பட்டது',
            list: '%{name}',
            loading: 'ஏற்றுக்கின்றது',
            not_found: 'காணப்படவில்லை',
            show: '%{name} %{recordRepresentation} காட்டு',
            empty: 'இன்னும் %{name} எதுவும் இல்லை.',
            invite: 'ஒருவரைச் சேர்க்க விரும்புகிறீர்களா?',
        },
        input: {
            file: {
                upload_several:
                    'பல கோப்புகளை பதிவேற்ற இங்கே விடவும், அல்லது ஒன்றைத் தேர்வு செய்யுங்கள்.',
                upload_single: 'ஒரு கோப்பை பதிவேற்ற இங்கே விடவும், அல்லது ஒன்றைத் தேர்வு செய்யுங்கள்.',
            },
            image: {
                upload_several:
                    'பல புகைப்படங்களை பதிவேற்ற இங்கே விடவும், அல்லது ஒன்றைத் தேர்வு செய்யுங்கள்.',
                upload_single:
                    'ஒரு புகைப்படத்தை பதிவேற்ற இங்கே விடவும், அல்லது ஒன்றைத் தேர்வு செய்யுங்கள்.',
            },
            references: {
                all_missing: 'குறிப்புக்களைக் கண்டுபிடிக்க முடியவில்லை.',
                many_missing:
                    'தொடர்புடைய குறிப்புகளில் அத்துடன் ஒன்று கிடைக்காது என்றும் தெரியாமையுள்ளது.',
                single_missing:
                    'தொடர்புடைய குறிப்பு இன்னும் கிடைக்கவில்லை என்றும் தெரியாமையுள்ளது.',
            },
            password: {
                toggle_visible: 'கடவுச்சொல் மறைக்கவும்',
                toggle_hidden: 'கடவுச்சொல் காட்டுக',
            },
        },
        message: {
            about: 'பற்றி',
            are_you_sure: 'நீங்கள் உறுதிப்படுத்துகிறீர்களா?',
            auth_error:
                'அனுமதி டோக்கனை சரிபார்க்கும்படி ஒரு பிழை ஏற்பட்டுள்ளது.',
            bulk_delete_content:
                'இந்த %{name} ஐ நீக்க விரும்புகிறீர்களா? |||| இந்த %{smart_count} பொருட்டுகளை நீக்க விரும்புகிறீர்களா?',
            bulk_delete_title:
                'நீக்குக %{name} |||| நீக்குக %{smart_count} %{name}',
            delete_content: 'நீக்க விரும்புகிறீர்களா %{name} ஐ?',
            delete_title: '%{name} ஐ நீக்கு',
            details: 'விவரங்கள்',
            error: 'ஒரு பிழை ஏற்பட்டுள்ளது மெய்நிகர் கருவியில் தரவை பெறுவதில்.',
            invalid_form: 'படிவத்தில் சில பிழைகள் உள்ளன.',
            loading: 'படிக்கும்',
            no: 'இல்லை',
            not_found: 'தகவல் பற்றி எதுவும் இல்லை.',
            yes: 'ஆம்',
            unsaved_changes:
                "சேமிக்கப்படவில்லை மாற்றங்கள் ஏற்பட்டுள்ளன. நீங்கள் மீளமைக்கவாமல் பக்கத்திலிருந்து வெளியேற விரும்புகிறீர்களா?",
        },
        navigation: {
            no_results: 'முடிவுகள் எதுவும் கிடைக்கவில்லை.',
            no_more_results:
                'பக்கத்தின் மேல்முடிவு அடுத்த பக்கத்திற்குள் செல்கிறது.',
            page_out_of_boundaries: 'பக்கத்தின் எண் %{page} பக்கங்களுக்குள் அல்லை.',
            page_out_from_end: 'இறுதியில் முடிவடைவதற்கு முன்னாக தரவில் பக்கங்கள் எதுவும் இல்லை',
            page_out_from_begin: 'முதலில் முடிவடைவதற்கு மேல் தரவுகள் எதுவும் இல்லை.',
            page_range_info: '%{offsetBegin}-%{offsetEnd} இல் மொத்தமான %{total}',
            page_rows_per_page: 'வரிசையில் பக்கத்தில்:',
            next: 'அடுத்தது',
            prev: 'முந்தையது',
        },
        auth: {
            auth_check_error: 'மொத்தமான மூலதனியக்க பிழை. தயவுசெய்து உள்நுழைய மீட்டருக்கு.',
            user_menu: 'பயனர்',
            username: 'பயனர்பெயர்',
            password: 'கடவுச்சொல்',
            sign_in: 'உள்நுழைய',
            sign_in_error: 'உள்நுழைவு தோல்வியுற்றது. மீளமைக்கவும் முயலுங்கள்.',
            logout: 'வெளியேறு',
        },
        notification: {
            updated: 'மேம்படுத்தப்பட்டது |||| %{smart_count} பொருட்கள் மேம்படுத்தப்பட்டன',
            created: 'உருவாக்கப்பட்டது',
            deleted: 'நீக்கப்பட்டது |||| %{smart_count} பொருட்கள் நீக்கப்பட்டன',
            bad_item: 'செல்லாத பொருட்டுக்கான அளவு',
            item_doesnt_exist: 'பொருட்டுக்குள் பிழை உள்ளது',
            http_error: 'சர்வரும் பிழை',
            data_provider_error:
                'dataProvider பிழை. தயவுசெய்து விவரங்களை கண்டுபிடிக்க முடியவில்லை. மேலும் விவரங்களுக்கு கணினிப் பிழைகள் படிக்கப்படலாம்.',
            canceled: 'ரத்து செய்யப்பட்டது',
            logged_out: 'உள்நுழைவில் பிழை. தயவுசெய்து மீட்டருக்கு உள்நுழையுங்கள்.',
        },
        validation: {
            required: 'தேவைப்படுகிறது',
            minLength: 'குறைந்தபட்ச பொருத்தமாக %{min} எழுத்துகள்',
            maxLength: 'அதிகபட்ச பொருத்தமாக %{max} எழுத்துகள்',
            minValue: 'அதிகபட்ச மதிப்பை அடையாதீர்கள் %{min}',
            maxValue: 'அதிகபட்ச மதிப்பை அடையாதீர்கள் %{max}',
            number: 'மதிப்பை எண் மாற்றுக',
            email: 'தவறான மின்னஞ்சல்',
            oneOf: 'அரசியல் அமைப்பில் சரியானது இருக்க வேண்டும்: %{options}',
            regex: 'தகவல் எழுத்துரு தவறானது (regexp): %{pattern}',
        },
    },
};

export default raTranslation;
